<?php

return [
    '403' => [
        'title' => 'تم الرفض',
        'heading' => '403 ممنوع',
        'message' => 'ليس لديك إذن للوصول إلى هذه الصفحة.',
        'button' => 'العودة إلى الصفحة الرئيسية',
        'search_button' => 'بحث عن العقارات',
    ],
    '404' => [
        'title' => 'الصفحة غير موجودة',
        'heading' => "عذرًا، لم نتمكن من العثور على هذه الصفحة.",
        'message' => 'يبدو أن الرابط الذي اتبعته قديم أو مكسور. قد يكون العقار الذي تبحث عنه قد تم بيعه أو إزالته من قوائمنا.',
        'button' => 'العودة إلى الصفحة الرئيسية',
        'search_button' => 'بحث عن العقارات',
    ],
    '500' => [
        'title' => 'خطأ في الخادم',
        'heading' => 'عذرًا، حدث خطأ ما.',
        'message' => 'نحن نواجه حاليًا بعض المشاكل التقنية. تم إخطار فريقنا ونحن نعمل على إصلاحها في أقرب وقت ممكن. يرجى المحاولة مرة أخرى لاحقًا.',
        'button' => 'العودة إلى الصفحة الرئيسية',
        'status_button' => 'التحقق من حالة النظام',
    ]
];
