<?php

return [
    'messages' => [
        'first_name.required' => 'حقل الاسم الأول مطلوب.',
        'first_name.string' => 'حقل الاسم الأول يجب أن يكون نصًا.',
        'first_name.max' => 'حقل الاسم الأول يجب ألا يزيد عن 255 حرفًا.',
        'last_name.required' => 'حقل اسم العائلة مطلوب.',
        'last_name.string' => 'حقل اسم العائلة يجب أن يكون نصًا.',
        'last_name.max' => 'حقل اسم العائلة يجب ألا يزيد عن 255 حرفًا.',
        'email.required' => 'حقل البريد الإلكتروني مطلوب.',
        'email.string' => 'حقل البريد الإلكتروني يجب أن يكون نصًا.',
        'email.email' => 'حقل البريد الإلكتروني يجب أن يكون بريدًا إلكترونيًا صالحًا.',
        'email.max' => 'حقل البريد الإلكتروني يجب ألا يزيد عن 255 حرفًا.',
        'email.unique' => 'البريد الإلكتروني مستخدم من قبل.',
        'mobile.required' => 'حقل رقم الهاتف مطلوب.',
        'mobile.string' => 'حقل رقم الهاتف يجب أن يكون نصًا.',
        'mobile.unique' => 'رقم الهاتف مستخدم من قبل.',
        'password.required' => 'حقل كلمة المرور مطلوب.',
        'password.min' => 'حقل كلمة المرور يجب أن يكون على الأقل 8 أحرف
        و تحوي رموز وارقام  وأحرف كبيرة وأحرف صغيرة.',
        'password_confirmation.required' => 'حقل تأكيد كلمة المرور مطلوب.',
        'password_confirmation.same' => 'حقل تأكيد كلمة المرور يجب أن يتطابق مع كلمة المرور.',
        'agreeTerms.accepted' => 'يجب الموافقة على الشروط.',
    ],
    'attributes' => [
        'first_name' => 'الاسم الأول',
        'last_name' => 'اسم العائلة',
        'email' => 'البريد الإلكتروني',
        'mobile' => 'رقم الهاتف',
        'password' => 'كلمة المرور',
        'password_confirmation' => 'تأكيد كلمة المرور',
        'agreeTerms' => 'الموافقة على الشروط',
    ],
];
