<?php

return [
    'messages' => [
        'first_name.required' => 'حقل الاسم الأول مطلوب.',
        'first_name.string' => 'حقل الاسم الأول يجب أن يكون نصًا.',
        'first_name.max' => 'حقل الاسم الأول يجب ألا يزيد عن 255 حرفًا.',
        'last_name.required' => 'حقل اسم العائلة مطلوب.',
        'last_name.string' => 'حقل اسم العائلة يجب أن يكون نصًا.',
        'last_name.max' => 'حقل اسم العائلة يجب ألا يزيد عن 255 حرفًا.',
        'mobile.required' => 'حقل رقم الهاتف مطلوب.',
        'mobile.phone' => 'رقم الهاتف غير صحيح. يرجى إدخال رقم هاتف صحيح مع رمز الدولة.',
        'image.image' => 'يجب أن يكون الملف صورة.',
        'image.mimes' => 'يجب أن تكون الصورة من نوع jpeg أو png أو jpg.',
        'image.max' => 'يجب ألا يزيد حجم الصورة عن 2048 كيلوبايت.',
    ],
    'attributes' => [
        'first_name' => 'الاسم الأول',
        'last_name' => 'اسم العائلة',
        'mobile' => 'رقم الهاتف',
        'image' => 'الصورة',
    ],
];
