<?php

return [
    'hero' => [
        'animate_text' => [
            'static_text' => 'ابحث عن',
            'text-1' => 'منزل أحلامك',
            'text-2' => 'عقارك المثالي',
            'text-3' => 'استثمارك القادم',
            'text-4' => 'الإيجار المناسب',
        ],
        'small_text' => "نحن وكالة عقارية ستساعدك في العثور على أفضل سكن تحلم به.\nاكتشف مجموعة واسعة من العقارات المصممة خصيصًا لتلبية احتياجاتك.",
        'search' => [
            'all' => 'الكل',
            'all_category' => 'جميع الفئات',
            'all_city' => 'جميع المدن / المحافظات',
            'rooms_count' => 'الغرف',
            'advance_filter' => 'بحث متقدم',
            'search' => 'بحث',
            'reset' => 'إعادة تعين',
            'type' => 'النوع',
            'category' => 'الفئة',
            'city' => 'المحافظة',
            'price' => 'السعر',
            'price_min' => 'السعر الأدنى',
            'price_max' => 'السعر الأعلى',
            'floor_min'                 => 'الطابق الأدنى',
            'floor_max'                 => 'الطابق الأعلى',
            'area_min'                 => 'المساحة الأدنى',
            'area_max'                 => 'المساحة الأعلى',
            'area' => 'المساحة',
            'sqm' => 'م²',
            'min_area' => 'المساحة الدنيا',
            'max_area' => 'المساحة القصوى',
            'condition' => 'حالة العقار',
            'floor' => 'الطابق',
            'orientation' => 'الاتجاه',
            'amenities' => 'الميزات والمرافق',
        ],
    ],
    'lists' => [
        'categories_title' => 'الفئات',
        'cities_title' => 'المدن',
        'new_properties' => 'مضاف حديثاً',
        'features_properties' => 'موصى بها',
    ]
];
